{
  "version": "Notebook/1.0",
  "items": [
    {
      "type": 1,
      "content": {
        "json": "# Staged Rollout users/groups and sign-ins\r\n"
      },
      "name": "text - 10"
    },
    {
      "type": 3,
      "content": {
        "version": "KqlItem/1.0",
        "query": "AuditLogs \r\n| where OperationName contains 'feature'\r\n        and OperationName contains 'user'\r\n        and OperationName contains 'add'\r\n| where TimeGenerated > ago(30d) \r\n| make-series count(OperationName) \r\n    on TimeGenerated in range(ago(30d), now(), 1d) by OperationName\r\n\r\n\r\n\r\n",
        "size": 1,
        "title": "Users added to Staged Rollout",
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces",
        "visualization": "timechart",
        "tileSettings": {
          "titleContent": {
            "formatter": 19,
            "formatOptions": {
              "palette": "blue"
            }
          },
          "leftContent": {
            "columnMatch": "count_OperationName",
            "formatter": 12,
            "formatOptions": {
              "palette": "blue"
            }
          },
          "secondaryContent": {
            "columnMatch": "OperationName",
            "formatter": 9,
            "formatOptions": {
              "palette": "blue"
            }
          },
          "showBorder": false
        }
      },
      "customWidth": "50",
      "showPin": true,
      "name": "query - 0"
    },
    {
      "type": 3,
      "content": {
        "version": "KqlItem/1.0",
        "query": "AuditLogs \r\n| where OperationName contains 'feature'\r\n        and OperationName contains 'user'\r\n        and OperationName contains 'remove'\r\n| where TimeGenerated > ago(30d) \r\n| make-series count(OperationName) \r\n    on TimeGenerated in range(ago(30d), now(), 1d) by OperationName",
        "size": 1,
        "title": "Users removed from Staged Rollout",
        "timeContext": {
          "durationMs": 2592000000
        },
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces",
        "visualization": "timechart"
      },
      "customWidth": "50",
      "name": "query - 2"
    },
    {
      "type": 3,
      "content": {
        "version": "KqlItem/1.0",
        "query": "AuditLogs \r\n| where OperationName contains 'feature'\r\n        and OperationName contains 'group'\r\n        and OperationName contains 'add'\r\n| where TimeGenerated > ago(30d) \r\n| make-series count(OperationName) \r\n    on TimeGenerated in range(ago(30d), now(), 1d) by OperationName",
        "size": 1,
        "title": "Groups added to Satged Rollout",
        "timeContext": {
          "durationMs": 2592000000
        },
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces",
        "visualization": "timechart"
      },
      "customWidth": "50",
      "name": "query - 4"
    },
    {
      "type": 3,
      "content": {
        "version": "KqlItem/1.0",
        "query": "AuditLogs \r\n| where OperationName contains 'feature'\r\n        and OperationName contains 'group'\r\n        and OperationName contains 'remove'\r\n| where TimeGenerated > ago(30d) \r\n| make-series count(OperationName) \r\n    on TimeGenerated in range(ago(30d), now(), 1d) by OperationName",
        "size": 1,
        "title": "Groups removed from Staged Rollout",
        "timeContext": {
          "durationMs": 2592000000
        },
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces",
        "visualization": "timechart"
      },
      "customWidth": "50",
      "name": "query - 5"
    },
    {
      "type": 3,
      "content": {
        "version": "KqlItem/1.0",
        "query": "SigninLogs\r\n| extend x = parse_json(AuthenticationDetails)[0]\r\n| extend AuthMethod = tostring(x.authenticationMethod)\r\n| extend AuthFailed = (x.succeeded != true)\r\n| where  TimeGenerated >= ago(30d) and\r\n        (AuthMethod has \"StagedRollout\")  \r\n| summarize NumSignIns = count() by DayOfMonth = bin(TimeGenerated, 1d), UserPrincipalName, AppDisplayName, AuthMethod, AuthFailed\r\n| order by DayOfMonth",
        "size": 0,
        "title": "Users in Staged Rollout sign-ins",
        "timeContext": {
          "durationMs": 2592000000
        },
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces",
        "gridSettings": {
          "filter": true,
          "sortBy": [
            {
              "itemKey": "UserPrincipalName",
              "sortOrder": 1
            }
          ]
        },
        "sortBy": [
          {
            "itemKey": "UserPrincipalName",
            "sortOrder": 1
          }
        ],
        "tileSettings": {
          "showBorder": false
        }
      },
      "customWidth": "50",
      "name": "query - 1"
    },
    {
      "type": 3,
      "content": {
        "version": "KqlItem/1.0",
        "query": "SigninLogs\r\n| extend x = parse_json(AuthenticationDetails)[0]\r\n| extend AuthMethod = tostring(x.authenticationMethod)\r\n| where AuthMethod has \"StagedRollout\"\r\n| extend AuthFailed = (x.succeeded != true)\r\n| where x.succeeded != true\r\n| extend authenticationStepResultDetail = x.authenticationStepResultDetail\r\n| project ['User principal name'] = UserPrincipalName, UserDisplayName, AppDisplayName, AuthMethod, AuthFailed, ['Failed Auth Reason'] = x.authenticationStepResultDetail\r\n\r\n\r\n\r\n",
        "size": 0,
        "title": "Users in Staged Rollout failed sign-ins reasons",
        "timeContext": {
          "durationMs": 2592000000
        },
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces",
        "gridSettings": {
          "filter": true
        }
      },
      "customWidth": "50",
      "name": "query - 5"
    },
    {
      "type": 3,
      "content": {
        "version": "KqlItem/1.0",
        "query": "SigninLogs\r\n| extend x = parse_json(AuthenticationDetails)[0]\r\n| extend AuthMethod = tostring(x.authenticationMethod)\r\n| extend FailureDetail = tostring(x.authenticationStepResultDetail)\r\n| extend AuthFailed = (x.succeeded != true)\r\n| where x.succeeded != true\r\n| where  TimeGenerated >= ago(30d) and (AuthMethod has \"StagedRollout\")\r\n| summarize NumSignIns = count() by FailureDetail\r\n| order by NumSignIns\r\n\r\n",
        "size": 1,
        "title": "Sign-ins failure reasons last 30 days",
        "timeContext": {
          "durationMs": 2592000000
        },
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces",
        "gridSettings": {
          "formatters": [
            {
              "columnMatch": "FailureDetail",
              "formatter": 0,
              "formatOptions": {
                "customColumnWidthSetting": "140ch"
              }
            },
            {
              "columnMatch": "x_authenticationStepResultDetail",
              "formatter": 0,
              "formatOptions": {
                "customColumnWidthSetting": "140ch"
              }
            }
          ],
          "filter": true
        }
      },
      "customWidth": "50",
      "name": "query - 8"
    },
    {
      "type": 3,
      "content": {
        "version": "KqlItem/1.0",
        "query": "SigninLogs\r\n| extend x = parse_json(AuthenticationDetails)[0]\r\n| extend AuthMethod = tostring(x.authenticationMethod)\r\n| extend FailureDetail = tostring(x.authenticationStepResultDetail)\r\n| extend AuthFailed = (x.succeeded != true)\r\n| where x.succeeded != true\r\n| where  TimeGenerated >= ago(30d) and (AuthMethod has \"StagedRollout\")\r\n| summarize NumSignIns = count() by FailureDetail\r\n| render piechart \r\n",
        "size": 0,
        "title": "Sign-ins failure last 30 days",
        "timeContext": {
          "durationMs": 2592000000
        },
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces"
      },
      "customWidth": "50",
      "name": "query - 9"
    },
    {
      "type": 3,
      "content": {
        "version": "KqlItem/1.0",
        "query": "AuditLogs \r\n| where OperationName contains 'feature'\r\n        and OperationName contains 'group'\r\n| extend x = parse_json(TargetResources)[0] \r\n| project ['GroupName'] = x.displayName, ActivityDateTime, OperationName, ['Result'] = iff(Result=='success', '✔️', '❌')",
        "size": 0,
        "title": "List of groups added/removed from Staged Rollout",
        "timeContext": {
          "durationMs": 2592000000
        },
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces",
        "gridSettings": {
          "formatters": [
            {
              "columnMatch": "GroupName",
              "formatter": 0,
              "formatOptions": {
                "customColumnWidthSetting": "30ch"
              },
              "numberFormat": {
                "unit": 0,
                "options": {
                  "style": "decimal",
                  "useGrouping": false
                }
              }
            }
          ],
          "filter": true,
          "sortBy": [
            {
              "itemKey": "ActivityDateTime",
              "sortOrder": 2
            }
          ]
        },
        "sortBy": [
          {
            "itemKey": "ActivityDateTime",
            "sortOrder": 2
          }
        ]
      },
      "customWidth": "50",
      "name": "query - 7"
    },
    {
      "type": 3,
      "content": {
        "version": "KqlItem/1.0",
        "query": "AuditLogs \r\n| where OperationName contains 'feature'\r\n        and OperationName contains 'user'\r\n| extend x = parse_json(TargetResources)[0] \r\n| extend NewValue = x.modifiedProperties[0].newValue\r\n| extend OldValue = x.modifiedProperties[0].oldValue\r\n| project ['UserPricipalName'] = x.userPrincipalName, ActivityDateTime, OperationName, ['Result'] = iff(Result=='success', '✔️', '❌'), NewValue, OldValue\r\n\r\n",
        "size": 0,
        "title": "List of users added/removed from Staged rollout results ",
        "timeContext": {
          "durationMs": 2592000000
        },
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces",
        "gridSettings": {
          "filter": true,
          "sortBy": [
            {
              "itemKey": "Result",
              "sortOrder": 2
            }
          ]
        },
        "sortBy": [
          {
            "itemKey": "Result",
            "sortOrder": 2
          }
        ]
      },
      "customWidth": "50",
      "name": "query - 6"
    }
  ],
  "fallbackResourceIds": [
    "/subscriptions/67f1e79b-7036-4a5a-9308-0de82af015eb/resourcegroups/jartek/providers/microsoft.operationalinsights/workspaces/jarteklogs"
  ],
  "$schema": "https://github.com/Microsoft/Application-Insights-Workbooks/blob/master/schema/workbook.json"
}